<a href="https://colab.research.google.com/github/apraveen005/machine_learning_with_python/blob/master/Lecture05_Oct03.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
room='kit'
room=='kit'

True

In [ ]:
if room=='kit':
  print('looking around the kitchen')
print('this is outside of if')

looking around the kitchen
this is outside of if

In [ ]:
area=14.0
if area>15:
  print('big place')

In [ ]:
room='bed'
if room=='kit':
  print('looking around the kitchen')
else:
  print('looking around in the bedroom')

looking around in the bedroom

In [ ]:
if area>15:
  print('big place')
else:
    print('pretty small')

pretty small

In [ ]:
if area>15:
  print('big place')
elif room=='bed':
  print('looking around the bedroom')
else:
    print('pretty small')

looking around the bedroom

In [ ]:
if area>15:
  print('big place')
elif area>10:
  print('medium size')
elif area==14:
  print('it is equal to 14')
else:
    print('pretty small')

medium size

1.Get a series
2.Get a boolean series ( by using bcondition)
3.surround with dataframename(the code used uptil second step)

In [ ]:
import pandas as pd
df=pd.read_csv('runs.csv')
df

     name  age  runs    country
0   rohit   22    55      india
1   kohli   44    77   pakistan
2     rup   33    66    america
3     msd   40    99      india
4  pandey   55    88  austraila

In [ ]:
df['age']

0    22
1    44
2    33
3    40
4    55
Name: age, dtype: int64

In [ ]:
df['age']>30

0    False
1     True
2     True
3     True
4     True
Name: age, dtype: bool

In [ ]:
df[df['age']>30]

     name  age  runs    country
1   kohli   44    77   pakistan
2     rup   33    66    america
3     msd   40    99      india
4  pandey   55    88  austraila

In [ ]:
df

     name  age  runs    country
0   rohit   22    55      india
1   kohli   44    77   pakistan
2     rup   33    66    america
3     msd   40    99      india
4  pandey   55    88  austraila

In [ ]:
import numpy as np
df[np.logical_and(df['age']>30,df['age']<50)]

    name  age  runs   country
1  kohli   44    77  pakistan
2    rup   33    66   america
3    msd   40    99     india

In [ ]:
offset=8
while offset!=0:
  print('correcting....')
  offset=offset-1

correcting....
correcting....
correcting....
correcting....
correcting....
correcting....
correcting....
correcting....

In [ ]:
offset=-6
while offset!=0:
  print('correcting....')
  if offset>0:
    offset=offset-1
  else:
    offset=offset+1

correcting....
correcting....
correcting....
correcting....
correcting....
correcting....

In [ ]:
areas=[11.25,18.0,20.0,10.75,9.50]
for abc in areas:
  print(abc)

11.25
18.0
20.0
10.75
9.5

In [ ]:

for abc,pqr in enumerate(areas):
  print('the index is', abc, 'and the value is ',pqr)

the index is 0 and the value is  11.25
the index is 1 and the value is  18.0
the index is 2 and the value is  20.0
the index is 3 and the value is  10.75
the index is 4 and the value is  9.5

In [ ]:
def shout():
  """Creates a string with three exclamation marks"""
  shout_word='Congratulations'+ ' !!!'
  return shout_word

'Congratulations !!!'

In [ ]:
shout_word=shout()
shout_word

'Congratulations !!!'

In [ ]:
def shout(xyz='congrats'):
  '''Creates a string with three exclamation marks'''
  shout_word= xyz + ' !!!'
  return shout_word

In [ ]:
abc=shout('Python')
abc

'Python !!!'

In [ ]:
def add():
  sum=1+5
  return sum
a=add()
a

6

In [ ]:
def mul(a,b,c,d,e,f):
  return a*b*c*d*e*f
mul(1,2,3,4,5,6)

720

In [ ]:
def formula(x,y,z=8):
  return x*y*z
formula(1,2,8)

16

In [ ]:
a=23
b=25
def addage():
  '''Returns the age after 10 years'''
  return a+10,b+10

abc=addage()
abc

(33, 35)

In [ ]:
xyz=[1,2,3,4,5]
xyz[1]=22
xyz

[1, 22, 3, 4, 5]